[{"node_id":"1","node_question":"Are you analyzing the entire instrument (or two or more agreements as though they are a single instrument), or are you analyzing a feature or provision embedded within an agreement?","node_type":"q","node_summary":"Freestanding instruments and embedded features are often subject to the same accounting standards.  However, the accounting result can be significantly different.  Your response to this question determines whether the analysis follows the path applicable to a freestanding instrument or the path applicable to an embedded feature.  This determination is not always obvious. Click 'Help' for more information.","node_popover":"Here is an informal comment about this node.","node_r1":"Freestanding Instrument","node_t1":"2","node_r2":"Embedded Feature","node_t2":"52","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"394","node_faq":"81","node_asc":"60","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":0},{"node_id":"2","node_question":"Was this instrument issued as stock-based compensation to, and for goods and\/or services provided by, an employee?","node_type":"q","node_summary":"Stock-based compensation for goods and services issued to employees and nonemployees is subject to specfic accounting rules. These rules do not apply to ELTs issued to investors. However, these rules DO apply to stock-based compensation issued as a commission to a third-party broker on conjunction with investment transaction. Click 'Analyze' for a step-by-step analysis of these rules.","node_popover":"","node_r1":"Yes","node_t1":"2010","node_r2":"No","node_t2":"3","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"149","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":1},{"node_id":"3","node_question":"Was this instrument issued as stock-based compensation to, and for goods and\/or services provided by, a nonemployee?","node_type":"q","node_summary":"","node_popover":"","node_r1":"Yes","node_t1":"4","node_r2":"No","node_t2":"5","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"151","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":2},{"node_id":"4","node_question":"Have the goods and\/or services of the nonemployee already been provided?","node_type":"q","node_summary":"When goods and\/or services have already been provided, an equity-linked contracted falls within the scope derivative accounting consideration (ASC 815-40-55-1). If perforamance by the nonemployee is pending, the guidance of ASC 505-50 should be applied.","node_popover":"","node_r1":"Yes","node_t1":"6","node_r2":"No","node_t2":"2011","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"150","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":3},{"node_id":"5","node_question":"Is this a lease agreement?","node_type":"q","node_summary":"It is not uncommon for a lease agreement to contain some form of equity payment to the lessor as part of the lease arrangement. Leases are subject to specific rules which can be evaluated step-by-step by clicking \"Analyze\". Certain embedded features in the lease may need to be evaluated separately. Any equity-linked embedded features should be evaluated using this ELT analysis tool.","node_popover":"","node_r1":"Yes","node_t1":"2012","node_r2":"No","node_t2":"6","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"152","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":4},{"node_id":"6","node_question":"Does the instrument fall within the scope of ASC 480, <em>Liabilities - Distinguishing Liabilities from Equity<\/em>? ","node_type":"q","node_summary":"Generally, ASC 480 captures financial instruments that are mandatorily redeemable, obligations to repurchase shares of the entity's stock, and certain obligations to issue a variable number of shares. All elements of ASC 480 apply to public companies; however, certain elements have been deferred indefinitely for nonpublic companies.","node_popover":"","node_r1":"Yes","node_t1":"2001","node_r2":"No","node_t2":"7","node_r3":"Analyze","node_t3":"101","node_next":"","node_href":"","node_help":"77","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":5},{"node_id":"7","node_question":"Is there 1) one or more underlyings, and 2) a notional amount, a payment provision, or both?","node_type":"q","node_summary":"You have eliminated several areas of GAAP as being not applicable to this freestanding instrument. The next step is to determine if the instrument meets the accounting definition of a derivative. There are three criteria that make up the definition. This is the first. The questions that follow will address the second and third criteria.","node_popover":"","node_r1":"Yes","node_t1":"8a","node_r2":"No","node_t2":"8b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"61","node_faq":"105","node_asc":"63","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":6},{"node_id":"8","node_question":"Is there a low or no initial investment?","node_type":"q","node_summary":"This is the second of three questions to determine if the freestanding instrument meets the accounting defintion of a derivative.","node_popover":"","node_r1":"Yes","node_t1":"9a","node_r2":"No","node_t2":"9b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"64","node_faq":"107","node_asc":"65","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":7},{"node_id":"9","node_question":"Is there net settlement either by the terms of the contract, through a market mechanism or by delivery of a derivative instrument or asset that is readily convertible to cash?","node_type":"q","node_summary":"This is the third and last of three questions to determine if the freestanding instrument meets the accounting defintion of a derivative. Your responses to this question and the previous two will determine whether this instrument is then evlauted as a derivative or as a nonderivative financial instrument. ","node_popover":"","node_r1":"Yes","node_t1":"10a","node_r2":"No","node_t2":"10b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"66","node_faq":"108","node_asc":"111","node_blog":"","node_examples":"67","node_c1":"Based on your responses to the three previous questions, the instrument meets the accounting definition of a derivative. Further analysis is required to determine if the derivative instrument meets any of the derivative scope exceptions available.","node_c2":"Based on your responses to the three previous questions, the instrument does NOT meet the accounting definition of a derivative. However, since the instrument is linked to the entity's stock, further evaluation is required to determine if 1) the instrument is considered indexed to the company's stock and 2) whether the instrument should be classified in equity.","node_js":"na","id":8},{"node_id":"10","node_question":"","node_type":"d","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":9},{"node_id":"11","node_question":"Is the instrument's exercise contingent and, if so, is the contingency based on a) an observable market, other than the market for the issuer's stock, or b) an observable index, other than one measured solely by reference to the issuer's own operations?","node_type":"q","node_summary":"An equity-linked instrument that meets the accounting definition of a derivative is subject to derivative accounting unless it is both indexed to the entity's own stock and classified in equity. This is the first of two questions to determine if the freestanding agreement is indexed to the company's own stock.","node_popover":"","node_r1":"Yes","node_t1":"12a","node_r2":"No","node_t2":"12b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"121","node_faq":"122","node_asc":"123","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":10},{"node_id":"12","node_question":"Is the settlement amount equal to the difference between the fair value of a fixed number of the entity's shares and a) a fixed monetary amount or b) a fixed amount of debt issued by the entity?","node_type":"q","node_summary":"This is the second and last of two questions to determine if the freestanding agreement is indexed to the company's own stock. Your response to this question and the previous question will determine whether the analysis should continue to determine if the instrument is classified in equity (because is IS indexed to the entity's own stock) or should be classified as an asset or liability accounted for as a derivative instrument.","node_popover":"","node_r1":"Yes","node_t1":"13a","node_r2":"No","node_t2":"13b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"124","node_faq":"","node_asc":"125","node_blog":"","node_examples":"","node_c1":"Based on your responses to the two previous questions, the instrument is considered indexed to the entity's own stock. Further analysis is required to determine if the instrument should be classified in equity.","node_c2":"Based on your responses to the two previous questions, the instrument is NOT considered indexed to the entity's own stock and is therefore subject to derivative accounting.","node_js":"na","id":11},{"node_id":"13","node_question":"","node_type":"d","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":12},{"node_id":"14","node_question":"Does the contract require net cash settlement?","node_type":"q","node_summary":"Based upon your responses to the previous two questions, this instrument is considered indexed to the entity's own stock. The analysis will now determine if the instrument should be classified in equity. This and the next several questions focus on the settlement alternatives written into the agreement. A contract that requires net cash settlement is not eligible for equity classification.","node_popover":"","node_r1":"Yes","node_t1":"2015","node_r2":"No","node_t2":"15","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"126","node_faq":"136","node_asc":"137","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":13},{"node_id":"15","node_question":"Does the contract require physical settlement or net share settlement?","node_type":"q","node_summary":"A contract that requires physical settlement or net share settlement is eligible for equity classification as long as it meets all other equity classification conditions. Note that physical or net share settlement must be REQUIRED, not merely offered as a choice to either party.","node_popover":"","node_r1":"Yes","node_t1":"22","node_r2":"No","node_t2":"16","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"138","node_faq":"139","node_asc":"140","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":14},{"node_id":"16","node_question":"Does the contract provide the counterparty with the choice of net cash settlement or settlement in shares?","node_type":"q","node_summary":"The accounting standards assume that a contract that provides the counterparty with the choice of either net cash settlement or settlement in shares (physical or net) will be net cash settled. This assumption can be overcome in certain circumstances if the economic substance of the settlement alternatives are not equal.","node_popover":"","node_r1":"Yes","node_t1":"17","node_r2":"No","node_t2":"19","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"141","node_faq":"144","node_asc":"145","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":15},{"node_id":"17","node_question":"Is the economic value of the share settlement alternative greater than that of the net cash settlement alternative, or is the cash settlement alternative fixed or does it contain a cap or floor?","node_type":"q","node_summary":"","node_popover":"","node_r1":"Yes","node_t1":"51","node_r2":"No","node_t2":"18","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"157","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":16},{"node_id":"18","node_question":"Does the substance of the transaction in any way overcome the assumption of net cash settlement when the counterparty has the choice of net cash settlement or share settlement?","node_type":"q","node_summary":"If the counterparty has the choice of net cash or share settlement, net cash settlement is presumed unless the economic value of share settlement is greater than that of cash settlement. This evaluation should consider not only the value of the shares received, but also the costs associated with converting the shares to cash and the ease of doing so.","node_popover":"","node_r1":"Yes","node_t1":"19","node_r2":"No","node_t2":"2009","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"157","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":17},{"node_id":"19","node_question":"Does the contract provide the company with the choice of net cash settlement or settlement in shares?","node_type":"q","node_summary":"The accounting standards assume that a contract that provides the entity with the choice of either net cash settlement or settlement in shares (physical or net) will be net be share settled. This assumption can be overcome in certain circumstances if the economic substance of the settlement alternatives are not equal.","node_popover":"","node_r1":"Yes","node_t1":"22","node_r2":"No","node_t2":"22","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"154","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":18},{"node_id":"20","node_question":"Is the econimic value of the share settlement alternative greater than that of the cash settlement alternative, or is the cash settlement alternative fixed or does it contain a cap or floor?","node_type":"q","node_summary":"","node_popover":"","node_r1":"Yes","node_t1":"21","node_r2":"No","node_t2":"23","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"155","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":19},{"node_id":"21","node_question":"Does the substance of the transaction in any way overcome the assumption of share settlement when the entity has the choice of net cash settlement or share settlement?","node_type":"q","node_summary":"If the entity has the choice of net cash or share settlement, share settlement is presumed unless the economic value of share settlement is greater than that of cash settlement in which case the entity would presumably choose to avoid the uneconomic alternative. This evaluation should consider the entity's historic pattern of settling contracts where there was a similar choice of settlement alternatives.","node_popover":"","node_r1":"Yes","node_t1":"22","node_r2":"No","node_t2":"51","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"156","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":20},{"node_id":"22","node_question":"Does the contract permit the entity to settle in unregistered shares?","node_type":"q","node_summary":"Your responses to the previous set of questions indicates that the contract will be share settled according to its terms or based upon the economic substance of the transaction. The accounting standards impose additional conditions that must be met in order for the instrument to be classified in equity. The next set of questions, eight in all, will evaluate whether these additional conditions are met. ","node_popover":"","node_r1":"Yes","node_t1":"23a","node_r2":"No","node_t2":"23b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"158","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":21},{"node_id":"23","node_question":"Does the entity have sufficient authorized and unissued shares available to settle the contract after considering all other commitments that may require the issuance of stock during the maximum period the derivative contract could remain outstanding?","node_type":"q","node_summary":"This is the second of eight criteria that determine whether the freestanding instrument can be classified in equity.","node_popover":"","node_r1":"Yes","node_t1":"24a","node_r2":"No","node_t2":"24b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"159","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":22},{"node_id":"24","node_question":"Does the contract contain an explicit limit on the number of shares to be delivered in a share settlement?","node_type":"q","node_summary":"This is the third of eight criteria that determine whether the freestanding instrument can be classified in equity.","node_popover":"","node_r1":"Yes","node_t1":"25a","node_r2":"No","node_t2":"25b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"160","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":23},{"node_id":"25","node_question":"Are there any required cash payments to the counterparty in the event the company fails to make timely filings with the SEC?","node_type":"q","node_summary":"This is the fourth of eight criteria that determine whether the freestanding instrument can be classified in equity.","node_popover":"","node_r1":"Yes","node_t1":"26a","node_r2":"No","node_t2":"26b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"161","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":24},{"node_id":"26","node_question":"Are there any required cash payments to the counterparty if the shares initially delivered upon settlement are subsequently sold by the counterparty and the sales proceeds are insufficient to provide the counterparty with full return of the amount due?","node_type":"q","node_summary":"This is the fifth of eight criteria that determine whether the freestanding instrument can be classified in equity.","node_popover":"","node_r1":"Yes","node_t1":"27a","node_r2":"No","node_t2":"27b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"162","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":25},{"node_id":"27","node_question":"If the contract provides for net-cash settlement, is net-cash settlement required only in specific circumstances in which holders of shares underlying the contract also would receive cash in exchange for their shares?","node_type":"q","node_summary":"This is the sixth of eight criteria that determine whether the freestanding instrument can be classified in equity.","node_popover":"","node_r1":"Yes","node_t1":"28a","node_r2":"No","node_t2":"28b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"163","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":26},{"node_id":"28","node_question":"Are there any provisions in the contract that indicate that the counterparty has rights that rank higher than those of a shareholder of the stock underlying the contract?","node_type":"q","node_summary":"This is the seventh of eight criteria that determine whether the freestanding instrument can be classified in equity.","node_popover":"","node_r1":"Yes","node_t1":"29a","node_r2":"No","node_t2":"29b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"164","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":27},{"node_id":"29","node_question":"Is there a requirement in the contract to post collateral at any point or for any reason?","node_type":"q","node_summary":"This is the eight and last of eight questions to determine whether the freestanding instrument meets all conditions necessary for equity classification. Your response to this and the previous seven questions will make this determination. If it is determined that all conditions for equity classification are met, then the instrument should be classfied in equity and is NOT subject to derivative accounting. If all conditions for equity classification are not met, then the instrument should be classified as an asset or liability and accounted for as a derivative.","node_popover":"","node_r1":"Yes","node_t1":"30a","node_r2":"No","node_t2":"30b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"165","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"Based on your responses to the eight previous questions, the instrument is considered classified in equity.","node_c2":"Based on your responses to the eight previous questions, the instrument is NOT considered classified in equity.","node_js":"na","id":28},{"node_id":"30","node_question":"","node_type":"d","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":29},{"node_id":"31","node_question":"Is the instrument's exercise contingent and, if so, is the contingency based on a) an observable market, other than the market for the issuer's stock, or b) an observable index, other than one measured solely by reference to the issuer's own operations?","node_type":"q","node_summary":"An equity-linked instrument that does not meet the accounting definition of a derivative is subject to fair value accounting unless it is both indexed to the entity's own stock and classified in equity. This is the first of two questions to determine if the freestanding agreement is indexed to the company's own stock.","node_popover":"","node_r1":"Yes","node_t1":"32a","node_r2":"No","node_t2":"32b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"121","node_faq":"122","node_asc":"123","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":30},{"node_id":"32","node_question":"Is the settlement amount equal to the difference between the fair value of a fixed number of the entity's shares and a) a fixed monetary amount or b) a fixed amount of debt issued by the entity?","node_type":"q","node_summary":"This is the second and last of two questions to determine if the freestanding agreement is indexed to the company's own stock. Your response to this question and the previous question will determine whether the analysis should continue to determine if the instrument is classified in equity (because is IS indexed to the entity's own stock) or should be classified as an asset or liability accounted for at fair value.","node_popover":"","node_r1":"Yes","node_t1":"33a","node_r2":"No","node_t2":"33b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"124","node_faq":"","node_asc":"125","node_blog":"","node_examples":"","node_c1":"Based on your responses to the two previous questions, the instrument is considered indexed to the entity's own stock.","node_c2":"Based on your responses to the two previous questions, the instrument is NOT considered indexed to the entity's own stock.","node_js":"na","id":31},{"node_id":"33","node_question":"","node_type":"d","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":32},{"node_id":"34","node_question":"Does the contract require net cash settlement?","node_type":"q","node_summary":"Based upon your responses to the previous two questions, this instrument is considered indexed to the entity's own stock. The analysis will now determine if the instrument should be classified in equity. This and the next several questions focus on the settlement alternatives written into the agreement. A contract that requires net cash settlement is not eligible for equity classification.","node_popover":"","node_r1":"Yes","node_t1":"2015","node_r2":"No","node_t2":"35","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"126","node_faq":"136","node_asc":"137","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":33},{"node_id":"35","node_question":"Does the contract require physical settlement or net share settlement?","node_type":"q","node_summary":"A contract that requires physical settlement or net share settlement is eligible for equity classification as long as it meets all other equity classification conditions. Note that physical or net share settlement must be REQUIRED, not merely offered as a choice to either party.","node_popover":"","node_r1":"Yes","node_t1":"42","node_r2":"No","node_t2":"36","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"138","node_faq":"139","node_asc":"140","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":34},{"node_id":"36","node_question":"Does the contract provide the counterparty with the choice of net cash settlement or settlement in shares?","node_type":"q","node_summary":"The accounting standards assume that a contract that provides the counterparty with the choice of either net cash settlement or settlement in shares (physical or net) will be net cash settled. This assumption can be overcome in certain circumstances if the economic substance of the settlement alternatives are not equal.","node_popover":"","node_r1":"Yes","node_t1":"37","node_r2":"No","node_t2":"39","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"141","node_faq":"144","node_asc":"145","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":35},{"node_id":"37","node_question":"Is the economic value of the share settlement alternative greater than that of the net cash settlement alternative, or is the cash settlement alternative fixed or does it contain a cap or floor?","node_type":"q","node_summary":"","node_popover":"","node_r1":"Yes","node_t1":"39","node_r2":"No","node_t2":"38","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"157","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":36},{"node_id":"38","node_question":"Does the substance of the transaction in any way overcome the assumption of net cash settlement when the counterparty has the choice of net cash settlement or share settlement?","node_type":"q","node_summary":"If the counterparty has the choice of net cash or share settlement, net cash settlement is presumed unless the economic value of share settlement is greater than that of cash settlement. This evaluation should consider not only the value of the shares received, but also the costs associated with converting the shares to cash and the ease of doing so.","node_popover":"","node_r1":"Yes","node_t1":"39","node_r2":"No","node_t2":"2018","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"157","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":37},{"node_id":"39","node_question":"Does the contract provide the company with the choice of net cash settlement or settlement in shares?","node_type":"q","node_summary":"The accounting standards assume that a contract that provides the entity with the choice of either net cash settlement or settlement in shares (physical or net) will be net be share settled. This assumption can be overcome in certain circumstances if the economic substance of the settlement alternatives are not equal.","node_popover":"","node_r1":"Yes","node_t1":"40","node_r2":"No","node_t2":"42","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"154","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":38},{"node_id":"40","node_question":"Is the econimic value of the share settlement alternative greater than that of the cash settlement alternative, or is the cash settlement alternative fixed or does it contain a cap or floor?","node_type":"q","node_summary":"","node_popover":"","node_r1":"Yes","node_t1":"41","node_r2":"No","node_t2":"43","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"155","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":39},{"node_id":"41","node_question":"Does the substance of the transaction in any way overcome the assumption of share settlement when the entity has the choice of net cash settlement or share settlement?","node_type":"q","node_summary":"If the entity has the choice of net cash or share settlement, share settlement is presumed unless the economic value of share settlement is greater than that of cash settlement in which case the entity would presumably choose to avoid the uneconomic alternative. This evaluation should consider the entity's historic pattern of settling contracts where there was a similar choice of settlement alternatives.","node_popover":"","node_r1":"Yes","node_t1":"42","node_r2":"No","node_t2":"2018","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"156","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":40},{"node_id":"42","node_question":"Does the contract permit the entity to settle in unregistered shares?","node_type":"q","node_summary":"Your responses to the previous set of questions indicates that the contract will be share settled according to its terms or based upon the economic substance of the transaction. The accounting standards impose additional conditions that must be met in order for the instrument to be classified in equity. The next set of questions, eight in all, will evaluate whether these additional conditions are met. ","node_popover":"","node_r1":"Yes","node_t1":"43a","node_r2":"No","node_t2":"43b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"158","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":41},{"node_id":"43","node_question":"Does the entity have sufficient authorized and unissued shares available to settle the contract after considering all other commitments that may require the issuance of stock during the maximum period the derivative contract could remain outstanding?","node_type":"q","node_summary":"This is the second of eight criteria that determine whether the freestanding instrument can be classified in equity.","node_popover":"","node_r1":"Yes","node_t1":"44a","node_r2":"No","node_t2":"44b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"159","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":42},{"node_id":"44","node_question":"Does the contract contain an explicit limit on the number of shares to be delivered in a share settlement?","node_type":"q","node_summary":"This is the third of eight criteria that determine whether the freestanding instrument can be classified in equity.","node_popover":"","node_r1":"Yes","node_t1":"45a","node_r2":"No","node_t2":"45b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"160","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":43},{"node_id":"45","node_question":"Are there any required cash payments to the counterparty in the event the company fails to make timely filings with the SEC?","node_type":"q","node_summary":"This is the fourth of eight criteria that determine whether the freestanding instrument can be classified in equity.","node_popover":"","node_r1":"Yes","node_t1":"46a","node_r2":"No","node_t2":"46b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"161","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":44},{"node_id":"46","node_question":"Are there any required cash payments to the counterparty if the shares initially delivered upon settlement are subsequently sold by the counterparty and the sales proceeds are insufficient to provide the counterparty with full return of the amount due?","node_type":"q","node_summary":"This is the fifth of eight criteria that determine whether the freestanding instrument can be classified in equity.","node_popover":"","node_r1":"Yes","node_t1":"47a","node_r2":"No","node_t2":"47b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"162","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":45},{"node_id":"47","node_question":"If the contract provides for net-cash settlement, is net-cash settlement required only in specific circumstances in which holders of shares underlying the contract also would receive cash in exchange for their shares?","node_type":"q","node_summary":"This is the sixth of eight criteria that determine whether the freestanding instrument can be classified in equity.","node_popover":"","node_r1":"Yes","node_t1":"48a","node_r2":"No","node_t2":"48b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"163","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":46},{"node_id":"48","node_question":"Are there any provisions in the contract that indicate that the counterparty has rights that rank higher than those of a shareholder of the stock underlying the contract?","node_type":"q","node_summary":"This is the seventh of eight criteria that determine whether the freestanding instrument can be classified in equity.","node_popover":"","node_r1":"Yes","node_t1":"49a","node_r2":"No","node_t2":"49b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"164","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":47},{"node_id":"49","node_question":"Is there a requirement in the contract to post collateral at any point or for any reason?","node_type":"q","node_summary":"This is the eight and last of eight questions to determine whether the freestanding instrument meets all conditions necessary for equity classification. Your response to this and the previous seven questions will make this determination. If it is determined that all conditions for equity classification are met, then the instrument should be classfied in equity and is NOT subject to fair value accounting. If all conditions for equity classification are not met, then the instrument should be classified as an asset or liability and accounted for at fair value.","node_popover":"","node_r1":"Yes","node_t1":"50a","node_r2":"No","node_t2":"50b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"165","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"Based on your responses to the eight previous questions, the instrument is considered classified in equity.","node_c2":"Based on your responses to the eight previous questions, the instrument is NOT considered classified in equity.","node_js":"na","id":48},{"node_id":"50","node_question":"","node_type":"d","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":49},{"node_id":"51","node_question":"Does hedge accounting apply?","node_type":"q","node_summary":"Based on your previous answers an all intermediate conclusions, this instrument 1) is not considered indexed to the entity's own stock, 2) does not meet the criteria for equity classification, or 3) both, and is therefore subject to derivative accounting. There are two primary methods applicable to derivative accounting: hedge accounting and non-hedge accounting. While it is possible for an instrument indexed to the company's own stock to be a hedge, the criteria for hedge accounting are stringent, and must be met and formally documented PRIOR to entering into the hedging arrangement.","node_popover":"","node_r1":"Yes","node_t1":"2003","node_r2":"No","node_t2":"2004","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"146","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":50},{"node_id":"52","node_question":"Is the host contract of the embedded feature being evaluated considered conventional convertible debt?","node_type":"q","node_summary":"Based on your response to the previous two questions, the embedded derivative feature is considered indexed to the cenitity's own stock. If the contract also meets the criteria to be considered conventional convertible debt, bifurcation is not required.","node_popover":"","node_r1":"Yes","node_t1":"84","node_r2":"No","node_t2":"53","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"382","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":51},{"node_id":"53","node_question":"Is there 1) one or more underlyings, and 2) a notional amount, a payment provision, or both?","node_type":"q","node_summary":"You have determined that the host contract is not conventional convertible debt. The next step is to determine if the embedded feature meets the accounting definition of a derivative. There are three criteria that make up the definition. This is the first. The questions that follow will address the second and third criteria.","node_popover":"","node_r1":"Yes","node_t1":"54a","node_r2":"No","node_t2":"54b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"191","node_faq":"193","node_asc":"192","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":52},{"node_id":"54","node_question":"Is there a low or no initial investment?","node_type":"q","node_summary":"This is the second of three questions to determine if the embedded feature meets the accounting defintion of a derivative.","node_popover":"","node_r1":"Yes","node_t1":"55a","node_r2":"No","node_t2":"55b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"194","node_faq":"195","node_asc":"196","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":53},{"node_id":"55","node_question":"Is there net settlement either by the terms of the contract, through a market mechanism or by delivery of a derivative instrument or asset that is readily convertible to cash?","node_type":"q","node_summary":"This is the third and last of three questions to determine if the embedded feature meets the accounting defintion of a derivative. Your responses to this question and the previous two will determine whether this embedded feature is 1) bifurcated from the host contract, or 2) evaluated further for possible exceptions to derivative accounting.","node_popover":"","node_r1":"Yes","node_t1":"56a","node_r2":"No","node_t2":"56b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"197","node_faq":"198","node_asc":"","node_blog":"","node_examples":"","node_c1":"Based on your responses to the three previous questions, the embedded feature meets the accounting definition of a derivative.","node_c2":"Based on your responses to the three previous questions, the embedded feature does not meet the accounting definition of a derivative.","node_js":"na","id":54},{"node_id":"56","node_question":"","node_type":"d","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":55},{"node_id":"57","node_question":"Are the economic risks and characteristics of the embedded feature clearly and closely related to the economic risks and characteristics of the host contract?","node_type":"q","node_summary":"Based on your responses to the previous three questions, the accounting definition of a derivative is met and this embedded feature is potentially subject to derivative accounting. The analysis will now evaluate possible exceptions that may apply. The first of these is to determine of the embedded feature has economic risks and characteristics that are clearly and closely related to those of the host contract.","node_popover":"","node_r1":"Yes","node_t1":"80","node_r2":"No","node_t2":"58","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"202","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"An embedded derivative feature that is clearly and closely related to the host contract does not require bifurcation under derivative accounting.","node_c2":"An embedded derivative feature that is not considered clearly and closely related to the host contract should be analysze further for potential scope exceptions to derivative accounting.","node_js":"na","id":56},{"node_id":"58","node_question":"Is the embedded feature's exercise contingent and, if so, is the contingency based on a) an observable market, other than the market for the issuer's stock, or b) an observable index, other than one measured solely by reference to the issuer's own operations?","node_type":"q","node_summary":"An equity-linked embedded derivative that is not clearly and closely associated with the host contract is subject to bifurcation and derivative accounting unless it is both indexed to the entity's own stock and classified in equity. This is the first of two questions to determine if the embedded feature is indexed to the company's own stock.","node_popover":"","node_r1":"Yes","node_t1":"59a","node_r2":"No","node_t2":"59b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"199","node_faq":"200","node_asc":"123","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":57},{"node_id":"59","node_question":"Is the settlement amount equal to the difference between the fair value of a fixed number of the entity's shares  and a) a fixed monetary amount or b) a fixed amount of debt issued by the entity?","node_type":"q","node_summary":"This is the second and last of two questions to determine if the embedded feature is indexed to the company's own stock. Your response to this question and the previous question will determine whether the analysis should continue to determine if the embedded feature is classified in equity (because is IS indexed to the entity's own stock) or should be classified as an asset or liability accounted for as a derivative instrument.","node_popover":"","node_r1":"Yes","node_t1":"60a","node_r2":"No","node_t2":"60b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"201","node_faq":"","node_asc":"125","node_blog":"","node_examples":"","node_c1":"Based on your responses to the two previous questions, the embedded is considered indexed to the entity's own stock.","node_c2":"Based on your responses to the two previous questions, the embedded is NOT considered indexed to the entity's own stock.","node_js":"na","id":58},{"node_id":"60","node_question":"","node_type":"d","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":59},{"node_id":"61","node_question":"Does the embedded feature require net cash settlement?","node_type":"q","node_summary":"Based upon your responses to the previous two questions, this embedded feature is considered indexed to the entity's own stock. The analysis will now determine if the embedded feature should be classified in equity. This and the next several questions focus on the settlement alternatives written into the agreement. An embedded feature that requires net cash settlement is not eligible for equity classification.","node_popover":"","node_r1":"Yes","node_t1":"79","node_r2":"No","node_t2":"62","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"174","node_faq":"175","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":60},{"node_id":"62","node_question":"Does the embedded feature require either physical settlement or net share settlement?","node_type":"q","node_summary":"An embedded feature that requires physical settlement or net share settlement is eligible for equity classification as long as it meets all other equity classification conditions. Note that physical or net share settlement must be REQUIRED, not merely offered as a choice to either party.","node_popover":"","node_r1":"Yes","node_t1":"69","node_r2":"No","node_t2":"63","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"176","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":61},{"node_id":"63","node_question":"Does the embedded feature provide the counterparty with the choice of net cash settlement or settlement in shares?","node_type":"q","node_summary":"The accounting standards assume that an embedded feature that provides the counterparty with the choice of either net cash settlement or settlement in shares (physical or net) will be net cash settled. This assumption can be overcome in certain circumstances if the economic substance of the settlement alternatives are not equal.","node_popover":"","node_r1":"Yes","node_t1":"64","node_r2":"No","node_t2":"66","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"172","node_faq":"173","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":62},{"node_id":"64","node_question":"Is the economic value of the share settlement alternative greater than that of the net cash settlement alternative, or is the cash settlement alternative fixed or does it contain a cap or floor?","node_type":"q","node_summary":"","node_popover":"","node_r1":"Yes","node_t1":"65","node_r2":"No","node_t2":"66","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":63},{"node_id":"65","node_question":"Does the substance of the embedded feature in any way overcome the assumption of net cash settlement when the counterparty has the choice of net cash settlement or share settlement?","node_type":"q","node_summary":"If the counterparty has the choice of net cash or share settlement, net cash settlement is presumed unless the economic value of share settlement is greater than that of cash settlement. This evaluation should consider not only the value of the shares received, but also the costs associated with converting the shares to cash and the ease of doing so.","node_popover":"","node_r1":"Yes","node_t1":"66","node_r2":"No","node_t2":"79","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"171","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":64},{"node_id":"66","node_question":"Does the embedded feature provide the company with the choice of net cash settlement or settlement in shares?","node_type":"q","node_summary":"The accounting standards assume that an embedded feature that provides the entity with the choice of either net cash settlement or settlement in shares (physical or net) will be net be share settled. This assumption can be overcome in certain circumstances if the economic substance of the settlement alternatives are not equal.","node_popover":"","node_r1":"Yes","node_t1":"67","node_r2":"No","node_t2":"69","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"177","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":65},{"node_id":"67","node_question":"Is the econimic value of the share settlement alternative greater than that of the cash settlement alternative, or is the cash settlement alternative fixed or does it contain a cap or floor?","node_type":"q","node_summary":"","node_popover":"","node_r1":"Yes","node_t1":"68","node_r2":"No","node_t2":"69","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":66},{"node_id":"68","node_question":"Does the substance of the embedded feature in any way overcome the assumption of share settlement when the entity has the choice of net cash settlement or share settlement?","node_type":"q","node_summary":"If the entity has the choice of net cash or share settlement, share settlement is presumed unless the economic value of share settlement is greater than that of cash settlement in which case the entity would presumably choose to avoid the uneconomic alternative. This evaluation should consider the entity's historic pattern of settling contracts where there was a similar choice of settlement alternatives.","node_popover":"","node_r1":"Yes","node_t1":"69","node_r2":"No","node_t2":"79","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"170","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":67},{"node_id":"69","node_question":"Does the embedded feature permit the entity to settle in unregistered shares?","node_type":"q","node_summary":"Your responses to the previous set of questions indicates that the embedded feature will be share settled according to its terms or based upon the economic substance of the transaction. The accounting standards impose additional conditions that must be met in order for the embedded feature to be classified in equity. The next set of questions, eight in all, will evaluate whether these additional conditions are met. ","node_popover":"","node_r1":"Yes","node_t1":"70a","node_r2":"No","node_t2":"70b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"178","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":68},{"node_id":"70","node_question":"Does the entity have sufficient authorized and unissued shares available to settle the embedded feature after considering all other commitments that may require the issuance of stock during the maximum period the derivative contract could remain outstanding?","node_type":"q","node_summary":"This is the second of eight criteria that determine whether the embedded feature can be classified in equity.","node_popover":"","node_r1":"Yes","node_t1":"71a","node_r2":"No","node_t2":"71b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"180","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":69},{"node_id":"71","node_question":"Does the embedded feature contain an explicit limit on the number of shares to be delivered in a share settlement?","node_type":"q","node_summary":"This is the third of eight criteria that determine whether the embedded feature can be classified in equity.","node_popover":"","node_r1":"Yes","node_t1":"72a","node_r2":"No","node_t2":"72b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"181","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":70},{"node_id":"72","node_question":"Are there any required cash payments to the counterparty in the event the company fails to make timely filings with the SEC?","node_type":"q","node_summary":"This is the fourth of eight criteria that determine whether the embedded feature can be classified in equity.","node_popover":"","node_r1":"Yes","node_t1":"73a","node_r2":"No","node_t2":"73b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"182","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":71},{"node_id":"73","node_question":"Are there any required cash payments to the counterparty if the shares initially delivered upon settlement are subsequently sold by the counterparty and the sales proceeds are insufficient to provide the counterparty with full return of the amount due?","node_type":"q","node_summary":"This is the fifth of eight criteria that determine whether the embedded feature can be classified in equity.","node_popover":"","node_r1":"Yes","node_t1":"74a","node_r2":"No","node_t2":"74b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"184","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":72},{"node_id":"74","node_question":"If the embedded feature provides for net-cash settlement, is net-cash settlement required only in specific circumstances in which holders of shares underlying the contract also would receive cash in exchange for their shares?","node_type":"q","node_summary":"This is the sixth of eight criteria that determine whether the embedded feature can be classified in equity.","node_popover":"","node_r1":"Yes","node_t1":"75a","node_r2":"No","node_t2":"75b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"185","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":73},{"node_id":"75","node_question":"Are there any provisions in the embedded feature that indicate that the counterparty has rights that rank higher than those of a shareholder of the stock underlying the contract?","node_type":"q","node_summary":"This is the seventh of eight criteria that determine whether the embedded feature can be classified in equity.","node_popover":"","node_r1":"Yes","node_t1":"76a","node_r2":"No","node_t2":"76b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"187","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":74},{"node_id":"76","node_question":"Is there a requirement in the embedded feature to post collateral at any point or for any reason?","node_type":"q","node_summary":"This is the eight and last of eight questions to determine whether the embedded feature meets all conditions necessary for equity classification. Your response to this and the previous seven questions will make this determination. If it is determined that all conditions for equity classification are met, then the embedded feature should be classfied in equity and is NOT subject to bifurcation and derivative accounting. If all conditions for equity classification are not met, then the instrument should be classified  bifurcated from the host contract as an asset or liability and accounted for as a derivative.","node_popover":"","node_r1":"Yes","node_t1":"77a","node_r2":"No","node_t2":"77b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"188","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"Based on your responses to the eight previous questions, the embedded is considered classified in equity.","node_c2":"Based on your responses to the eight previous questions, the embedded is NOT considered classified.","node_js":"na","id":75},{"node_id":"77","node_question":"","node_type":"d","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":76},{"node_id":"78","node_question":"Will the entire host contract be accounted for as a hybrid due to the inability to determine the fair value of one or embedded features?","node_type":"d","node_summary":"If you or your valuation expert(s) have concluded that there is no way to determine the fair value of this embedded feature, or one or more other embedded features, the the accounting standards require that the entire instrument be accounted for as a hybrid instrument carried at fair value.","node_popover":"","node_r1":"Yes","node_t1":"2007","node_r2":"No","node_t2":"79","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"","id":77},{"node_id":"79","node_question":"Have you elected to account for the entire instrument as a hybrid?","node_type":"q","node_summary":"This is an election available to the entity that is typically chosen when the cost of determining the fair value of one or more embedded derivative features exceeds the cost of determining the fair value of the entire contract.","node_popover":"","node_r1":"Yes","node_t1":"2007","node_r2":"No","node_t2":"2008","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"189","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":78},{"node_id":"80","node_question":"Is the embedded feature a conversion option in a debt-host contract?","node_type":"q","node_summary":"The embedded feature does not require bifurcation and accounting as an embedded derivative based on the preceeding analysis. In certain circumstances, the embedded feature may still be subject to accounting separate from the host contract. The analysis now address these circumsatnces.","node_popover":"","node_r1":"Yes","node_t1":"84","node_r2":"No","node_t2":"2013","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":79},{"node_id":"81","node_question":"Is the embedded feature a conversion option in a debt-host contract?","node_type":"q","node_summary":"The embedded feature does not require bifurcation and accounting as an embedded derivative based on the preceeding analysis. In certain circumstances, the embedded feature may still be subject to accounting separate from the host contract. The analysis now address these circumsatnces.","node_popover":"","node_r1":"Yes","node_t1":"82","node_r2":"No","node_t2":"2013","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":80},{"node_id":"82","node_question":"Is the host contract a convertible debt instrument?","node_type":"q","node_summary":"Based on your response to the previous three questions, this instrument does not meet the definition of a derivative and is therefore not subject to derivative accounting. This analysis will now turn to other GAAP guidance to determine the appropriate accounting treament, starting with the overall nature of the agreement. What is a debt instrument?  A loan agreement, a debenture, a bond, a line of credit?basically any agreement that provides for the borrowing and repayment of money.","node_popover":"","node_r1":"Yes","node_t1":"84","node_r2":"No","node_t2":"83","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":81},{"node_id":"83","node_question":"Is the host contract convertible preferred stock?","node_type":"q","node_summary":"Is the debt convertible at the option of the holder?","node_popover":"","node_r1":"Yes","node_t1":"84","node_r2":"No","node_t2":"2013","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":82},{"node_id":"84","node_question":"Is there a beneficial conversion feature as of the date of issuance?","node_type":"q","node_summary":"A beneficial conversion feature exists when the effective conversion price is less then the stock price at inception of the agreement.  The effective conversion price is not necessarily the conversion price written into the agreement; rather, the effective conversion price equals the per share issuance proceeeds allocated to the convertible instrument.  Click 'Help' for more information.","node_popover":"","node_r1":"Yes","node_t1":"85","node_r2":"No","node_t2":"2005","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":83},{"node_id":"85","node_question":"Upon conversion may the entire convertible debt instrument be entirely or partially settled in cash or by transfer of some other asset?","node_type":"q","node_summary":"","node_popover":"","node_r1":"Yes","node_t1":"2020","node_r2":"No","node_t2":"2006","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":84},{"node_id":"101","node_question":"Is this a mandatorily redeemable financial instrument (e.g., mandatorily redeemable preferred stock)?","node_type":"q","node_summary":"","node_popover":"","node_r1":"Yes","node_t1":"2001","node_r2":"No","node_t2":"102","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":85},{"node_id":"102","node_question":"Is this instrument an obligation to repurchase the company's shares for cash or by transferring some other asset to the counterparty?","node_type":"q","node_summary":"","node_popover":"","node_r1":"Yes","node_t1":"2001","node_r2":"No","node_t2":"103","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":86},{"node_id":"103","node_question":"Is this an obligation to issue to the holder a variable number of shares based on a fixed monetary amount known at inception of the instrument?","node_type":"q","node_summary":"","node_popover":"","node_r1":"Yes","node_t1":"2001","node_r2":"No","node_t2":"104","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":87},{"node_id":"104","node_question":"Is this an obligation to issue to the holder a variable number of shares based on variations on something other than the fair value of the entitiy's own stock?","node_type":"q","node_summary":"","node_popover":"","node_r1":"Yes","node_t1":"2001","node_r2":"No","node_t2":"105","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":88},{"node_id":"105","node_question":"Is this an obligation to issue to the holder a variable number of shares based on variations inversely related to changes in the fair value of the entity's own stock?","node_type":"q","node_summary":"","node_popover":"","node_r1":"Yes","node_t1":"2001","node_r2":"No","node_t2":"7","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":" ","node_c2":"Based on your responses to the five previous questions, the instrument does not fall within the scope of ASC 480.","node_js":"na","id":89},{"node_id":"201","node_question":"Was this stock-based compensation issued to en employee?","node_type":"q","node_summary":"","node_popover":"","node_r1":"Yes","node_t1":"","node_r2":"No","node_t2":"","node_r3":"Analyze","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":90},{"node_id":"202","node_question":"Does the stock-based compensation meet the criteria for equity classification (718-10-25-6 to 718-10-25-19)?","node_type":"q","node_summary":"","node_popover":"","node_r1":"Yes","node_t1":"","node_r2":"No","node_t2":"","node_r3":"Analyze","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":91},{"node_id":"203","node_question":"Has the grant date been determined (718-10-25-5)?","node_type":"q","node_summary":"","node_popover":"","node_r1":"Yes","node_t1":"","node_r2":"No","node_t2":"","node_r3":"Analyze","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":92},{"node_id":"204","node_question":"Is there one or more conditions (718-10-25-20 to 718-10-25-21)?","node_type":"q","node_summary":"","node_popover":"","node_r1":"Yes","node_t1":"","node_r2":"No","node_t2":"","node_r3":"Analyze","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":93},{"node_id":"205","node_question":"Is there just one condition?","node_type":"q","node_summary":"","node_popover":"","node_r1":"Yes","node_t1":"","node_r2":"No","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":94},{"node_id":"206","node_question":"Is the condition a market condition?","node_type":"q","node_summary":"","node_popover":"","node_r1":"Yes","node_t1":"","node_r2":"No","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":95},{"node_id":"207","node_question":"Is the condition a performance condition?","node_type":"q","node_summary":"","node_popover":"","node_r1":"Yes","node_t1":"","node_r2":"No","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":96},{"node_id":"208","node_question":"Is the condition a service condition?","node_type":"q","node_summary":"","node_popover":"","node_r1":"Yes","node_t1":"","node_r2":"No","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":97},{"node_id":"301","node_question":"Determine the appropriate date for evaluating the variable interest","node_type":"q","node_summary":"The variable interest entity guidance should be applied as of the date the company first becomes involved with the entity. This is, in most cases, the date the company first holds a variable interest in the entity (such as an equity investment, a loan, a lease or other contractual arrangement). Following initial application of the variable interest entity guidance, the intial determination should only be reconsidered upon occurrence of specific events as listed in ASC 810-10-35-4.","node_popover":"","node_r1":"Continue","node_t1":"302","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"433","node_faq":"","node_asc":"","node_blog":"","node_examples":"436","node_c1":"","node_c2":"","node_js":"na","id":98},{"node_id":"302","node_question":"Are you evaluating the entity as a whole or a silo of the entity which you have already determined is a variable interest entity?","node_type":"q","node_summary":"The variable interest entoty guidance should be applied to any entity in which the company potentially holds a variable interest. Additionally, the guidance should also be applied to any silo of an entity when 1) the company holds a variable interest in the silo and 2) they entity has already been determined to be a variable interest entity. If an entity is not a VIE, then its silos, if any, do not need to be evaluated separately.","node_popover":"","node_r1":"Entity as a whole","node_t1":"303","node_r2":"A silo of the VIE","node_t2":"401","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"438","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":99},{"node_id":"303","node_question":"Is the entity in which the company holds an interest a legal entity?","node_type":"q","node_summary":"\"Legal entity\" includes a corporation, partnership, limited liability company (LLC), trust or any other type of legal entity that is formed under govermental authority for the purpose of holding assets, liabilities, or to conduct any type of activity.","node_popover":"","node_r1":"Yes","node_t1":"304","node_r2":"No","node_t2":"2301","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"439","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":100},{"node_id":"304","node_question":"Is the entity deemed to be a business?","node_type":"q","node_summary":"This is the \"business scope exception\". If the entity is determined to be a business as that term is defined and described in ASC 805, Business Combinations, then the entity does not need to be evaluated further under the VIE guidance so long as all other conditions applicable to this scope exception are met. The additional conditions are addressed subsequently. The task in this node is to determine if the entity meets the ASC 805 definition of a business.","node_popover":"","node_r1":"Yes","node_t1":"305","node_r2":"No","node_t2":"312","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"449","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":101},{"node_id":"305","node_question":"Did the company participate significantly in the design or redesign of the entity?","node_type":"q","node_summary":"An entity that meets the definition of a business pursuant to ASC 805 is exempt from consideration as a VIE as long as certain additonal conditions are met. The first of these conditions is that the company did not participate significantly in the design or redesign of the entity.","node_popover":"","node_r1":"Yes","node_t1":"306","node_r2":"No","node_t2":"308","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"452","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":102},{"node_id":"306","node_question":"Does the entity meet the \"operating joint venture\" exception?","node_type":"q","node_summary":"An entity that meets the definition of a business pursuant to ASC 805 is exempt from consideration as a VIE as long as certain additonal conditions are met. The first of these conditions is that the company did not participate significantly in the design or redesign of the entity. However, this condition does not apply to an operating joint venture that is under joint control by the company and an unrelated third party.","node_popover":"","node_r1":"Yes","node_t1":"308","node_r2":"No","node_t2":"307","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"453","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":103},{"node_id":"307","node_question":"Does the entity meet the \"franchisee\" exception?","node_type":"q","node_summary":"An entity that meets the definition of a business pursuant to ASC 805 is exempt from consideration as a VIE as long as certain additonal conditions are met. The first of these conditions is that the company did not participate significantly in the design or redesign of the entity. However, this condition does not apply to a franchisee.","node_popover":"","node_r1":"Yes","node_t1":"308a","node_r2":"No","node_t2":"308b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"454","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":104},{"node_id":"308","node_question":"Was the entity designed so that substantially all of its activities either involve or are conducted on behalf of the company and\/or its related parties?","node_type":"q","node_summary":"An entity that meets the definition of a business pursuant to ASC 805 is exempt from consideration as a VIE as long as certain additonal conditions are met. The second of these conditions is that the entity is not \"...designed so that substantially all of its activities either involve or are conducted  on behalf of the report entity  and its related parties.\" Thid determination is to be made from the perspective of the company. If the entity conducts substantially all of its business with an unrelatefd party, that fact is not relevent to the company's evaluation of this condition.","node_popover":"","node_r1":"Yes","node_t1":"309a","node_r2":"No","node_t2":"309b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"455","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":105},{"node_id":"309","node_question":"Did the company and its related parties provide more than 50% of the total equity, subordinated debt and other forms of subordinated financial support?","node_type":"q","node_summary":"An entity that meets the definition of a business pursuant to ASC 805 is exempt from consideration as a VIE as long as certain additonal conditions are met. The third of these conditions is that the company and its related parties do not provide more than 50% of the entities equity, subordinated debt, and other subordinated financial support.","node_popover":"","node_r1":"Yes","node_t1":"310a","node_r2":"No","node_t2":"310b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"456","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":106},{"node_id":"310","node_question":"Are the entity's activities primarily related to securitizations or other forms of asset-backed financings or single-lessee leasing arragements?","node_type":"q","node_summary":"An entity that meets the definition of a business pursuant to ASC 805 is exempt from consideration as a VIE as long as certain additonal conditions are met. The fourth of these conditions relates to entities that are traditionally special purpose entities, or SPEs.","node_popover":"","node_r1":"Yes","node_t1":"311a","node_r2":"No","node_t2":"311b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"457","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"Based on your responses, the entity qualifies for the \"business\" scope exception and is therefore no a variable interest entity.","node_c2":"Based on your responses, the entity does not qualify for the \"business\" scope exception.","node_js":"na","id":107},{"node_id":"311","node_question":"","node_type":"d","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":108},{"node_id":"312","node_question":"Is the entity a not-for-profit organization?","node_type":"q","node_summary":"A not-for-profit entity is exempt from consideration by the company as a VIE, but only if the NFP organization was not formed or structured in order to circumvent the VIE guidance.","node_popover":"","node_r1":"Yes","node_t1":"2303","node_r2":"No","node_t2":"313","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"445","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":109},{"node_id":"313","node_question":"Is the entity an employee benefit plan?","node_type":"q","node_summary":"Employee benefit plans of the entity that are subject to ASC 712 or 715 are exempt from consideration by the company as a VIE.","node_popover":"","node_r1":"Yes","node_t1":"2304","node_r2":"No","node_t2":"314","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"442","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":110},{"node_id":"314","node_question":"Is the entity an investment company accounted for at fair value under ASC 946?","node_type":"q","node_summary":"An entity that is subject to the accounting guidance of ASC 946 is exempt from consideration by the company as a VIE.","node_popover":"","node_r1":"Yes","node_t1":"2305","node_r2":"No","node_t2":"315","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"443","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":111},{"node_id":"315","node_question":"Is the entity a \"separate accounts\" of a life insurance entity as described in Topic 944?","node_type":"q","node_summary":"Separate accounts of a life insurance company as described in ASC 944 are exempt from consideration by the company as a VIE.","node_popover":"","node_r1":"Yes","node_t1":"2306","node_r2":"No","node_t2":"316","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":112},{"node_id":"316","node_question":"Does the entity qualify for the \"information out\" exception?","node_type":"q","node_summary":"The \"information-out\" exemption applies only to interests in VIEs or potential VIEs prior to December 31, 2003. This exemption is unlikely to apply to any entity at this point in time. However, for the sake of completeness, the exemption is included in this analysis.","node_popover":"","node_r1":"Yes","node_t1":"2307","node_r2":"No","node_t2":"317","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":113},{"node_id":"317","node_question":"Is the entity a government organization?","node_type":"q","node_summary":"A government entity is exempt from consideration by the company as a VIE, but only if the government entity was not formed or structured in order to circumvent the VIE guidance.","node_popover":"","node_r1":"Yes","node_t1":"2308","node_r2":"No","node_t2":"318","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"444","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":114},{"node_id":"318","node_question":"Does the entity meet the conditions for deferral of the VIE model under ASU 2010-10?","node_type":"q","node_summary":"ASU 2010-10 provides for a deferral of the VIE model with respect to certain investment entities that have the attributes of entities subject to the accounting guidance os ASC 946.","node_popover":"","node_r1":"Yes","node_t1":"2309","node_r2":"No","node_t2":"319","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"447","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"Based on your responses, the entity does not qualify for a scope exception to the variable interest entity guidance. The next step is to determine if the company holds a variable interest in the entity.","node_js":"na","id":115},{"node_id":"319","node_question":"Does the company hold one or more variable interests in the entity?","node_type":"q","node_summary":"Identification of the creators of risk (i.e., variability) in an entity and the absorbers of that risk (the variable interests) is a complex and time consuming process. For those users having significant experience with this process, you may answer 'yes' or 'no' and make reference to your analysis in the comments box. For those with less or no experience with this analysis process, a more detailed approach is provided by clicking 'analyze'. Detailed instructions are provided in later steps; however, please be prepared to document your analysis separately (in a spreadsheet or some other form of your choosing).","node_popover":"","node_r1":"Yes","node_t1":"338","node_r2":"No","node_t2":"2310","node_r3":"Analyze","node_t3":"320","node_next":"","node_href":"","node_help":"459","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":116},{"node_id":"320","node_question":"Step 1: Identify all risks that the entity was designed to create.","node_type":"q","node_summary":"The creation of risk occurs through the ownership of assets, the conduct of the entities operations, and through certain contractual relationships. The risks created by design are those risks that the entity purposely exposes itself to based on the purpose of its existence.","node_popover":"","node_r1":"Continue to Step 2","node_t1":"321","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"460","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":117},{"node_id":"321","node_question":"Step 2: Identify the variability created by the identified risks","node_type":"q","node_summary":"Risks give rise to variability, usually in the form of cash flow variability or fair value variability. The form of this variability is significant to the determination of the variable interest(s) that absorb the variability created.","node_popover":"","node_r1":"Continue","node_t1":"322","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"462","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":118},{"node_id":"322","node_question":"Step 2.1 - Is interest rate variability one of the identified variabilities of the entity?","node_type":"q","node_summary":"Interest rate risk is pervasive and affects many entities. The nature of the interest rate risk and how it manifests itself in the entity are significant factors in determining how the interest rate variability is to be treated, that is whether it is serving to absorb variability or create variability. If the entity was not designed to create and pass along interest variability, then interest rate variability can be excluded from the analysis.","node_popover":"","node_r1":"Yes","node_t1":"323","node_r2":"No","node_t2":"328","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"464","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":119},{"node_id":"323","node_question":"Step 2.1.1 - Is the interest rate variability hedged?","node_type":"q","node_summary":"Interest rate variability that is hedged is a strong indicator that the entity was not designed to create and pass along interest rate variability to its interest holders.","node_popover":"","node_r1":"Yes","node_t1":"324","node_r2":"No","node_t2":"327","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"465","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":120},{"node_id":"324","node_question":"Step 2.1.2 - Is the hedging instrument based on  a market observable index?","node_type":"q","node_summary":"Is the hedging instrument based on  a market observable index?","node_popover":"","node_r1":"Yes","node_t1":"325","node_r2":"No","node_t2":"327","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"","id":121},{"node_id":"325","node_question":"Step 2.1.3 - Is the hedge counterparty equal in priority to at least the most senior interest in the legal entity?","node_type":"q","node_summary":"","node_popover":"","node_r1":"Yes","node_t1":"326","node_r2":"No","node_t2":"327","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"","id":122},{"node_id":"326","node_question":"Step 2.1.4 - Does the hedge offset all, or substantially all, of the risks?","node_type":"q","node_summary":"The nature of the hedge and its effectiveness at absorbing interest rate variability should be assessed as part of the determination of whether or not to exclude interest rate variability from consideration.  Additionally, interest rate variability even when hedged should only be excluded if the counterparty to the hedge ranks at least equal to the most senior interest(s) in the entity.","node_popover":"","node_r1":"Yes","node_t1":"327a","node_r2":"No","node_t2":"327b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":123},{"node_id":"327","node_question":"Step 2.1.5 - Is any of the interest rate variability associated with interest-bearing assets that will be held to maturity?","node_type":"q","node_summary":"An entity designed to buy and hold interest rate-bearing instruments to maturity is a strong indicator that the entity was not designed to create and pass along interest variability to its interest holders.","node_popover":"","node_r1":"Yes","node_t1":"328a","node_r2":"No","node_t2":"328b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"467","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"Interest rate variability that is derived from interest-bearing assets that will be held to maturity should generally be excluded from consideration.","node_c2":"Interest rate variability that is derived from interest-bearing assets that will be sold prior to maturity by design (usually to pay off debt of the entity) should be included in the list of creators of variability.","node_js":"na","id":124},{"node_id":"328","node_question":"Step 2.2 - Is the entity party to one or more derivative instruments?","node_type":"q","node_summary":"A derivative can either create variability (as a speculative investment) or absorb variability (as a hedging instrument). Even if the derivative absorbs variability, if may not be considered a variable interest. Whether the derivative is a creator of variability or an absorber of variability (a variable interest) ultimately depends upon the design of the entity and the risks it was designed to create and pass on to its interest holders.","node_popover":"","node_r1":"Yes","node_t1":"329","node_r2":"No","node_t2":"330","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":125},{"node_id":"329","node_question":"Step 2.2.2 - Evaluate the derivative by reference to the risks the entity was designed to create and pass along to its interest holders.","node_type":"q","node_summary":"A derivative instrument with both 1) an observable market-based underlying and 2) a counterparty who ranks senior to other interests of the entity is generally considered a creator of variability (and is therefore generally not a variable interest). If either or both characteristics are lacking, then the derivative instrument is generally considered an absorber of variability (and is therefore generally a variable interest). However, if the changes in cash flow or fair value of the derivative are expected to offset all, or substantially all, of the risk or return, or both, related to a majority of the entity's assets, then the variability that the derivative absorbs was probably not intended by design to be created and passed along to interst holders. In this case, the derivative is probably a variable interest. ","node_popover":"","node_r1":"Continue","node_t1":"330","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":126},{"node_id":"330","node_question":"Step 2.3 - Does one or more of the assets (or liabilities) identified as a creator of variability each contain one or more embedded derivatives?","node_type":"q","node_summary":"An embedded derivative can either create variability (as a speculative investment) or absorb variability (as a hedging instrument). If the embedded derivative is not clearly and clesly related to its host asset (or liability), then it should be separately evaluated as if it were freestanding.","node_popover":"","node_r1":"Yes","node_t1":"331","node_r2":"No","node_t2":"333","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"A derivative instrument with both 1) an observable market-based underlying and 2) a counterparty who ranks senior to other interests of the entity is generally considered a creator of variability (and is therefore generally not a variable interest).","node_c2":"A derivative instrument lacking 1) an observable market-based underlying and\/or 2) a counterparty who ranks senior to other interests of the entity is generally considered an absorber of variability (and is therefore generally a variable interest).","node_js":"na","id":127},{"node_id":"331","node_question":"Step 2.3.1 - Evaluate each embedded derivative further to determine whether it is clearly and closely related to its asset (or liability) host.","node_type":"q","node_summary":"An embedded derivative that is clearly and closely related to its host asset (or liability) does not need to be separately considered as either a creator or an absorber of variability.","node_popover":"","node_r1":"Continue","node_t1":"332","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":128},{"node_id":"332","node_question":"Step 2.3.2 - Evaluate the embedded derivative by reference to the risks the entity was designed to create and pass along to ints interest holders.","node_type":"q","node_summary":"An embedded derivative that is not clearly and closely related to its host asset (or liability) that has both 1) an observable market-based underlying and 2) a counterparty who ranks senior to other interests of the entity is generally considered a creator of variability (and is therefore generally not a variable interest). If either or both characteristics are lacking, then the embedded derivative is generally considered an absorber of variability (and is therefore generally a variable interest). However, if the changes in cash flow or fair value of the embedded derivative are expected to offset all, or substantially all, of the risk or return, or both, related to a majority of the entity's assets, then the variability that the embedded derivative absorbs was probably not intended by design to be created and passed along to interst holders. In this case, the embedded derivative is probably a variable interest. ","node_popover":"","node_r1":"Continue to Step 3","node_t1":"333","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":129},{"node_id":"333","node_question":"Step 3: Identify the explicit variable interests that absorb the identified variability.","node_type":"q","node_summary":"Based on contractual rights and obligations or pursuant to the governing documents of the entity, the explicit variable interests that absorb the identified variability either receive the gains and\/or positive cash flows, are obligated to absorb losses and\/or negative cash flows, or both. The explicit variable interests should be identified and related to the identified creator(s) of variability.","node_popover":"","node_r1":"Continue to Step 4","node_t1":"334","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"471","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":130},{"node_id":"334","node_question":"Step 4: Identify the implicit variable interests that absorb variability","node_type":"q","node_summary":"Certain parties associated with the entity may hold variable interests in the entity implicitly due to other relationships.","node_popover":"","node_r1":"Continue to Step 5","node_t1":"335","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"476","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":131},{"node_id":"335","node_question":"Step 5: Identify any variable interests in specified assets.","node_type":"q","node_summary":"Certain variable interests may relate only to specific assets of the entity, and not the entity as a whole.","node_popover":"","node_r1":"Continue to Step 6","node_t1":"336","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"478","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":132},{"node_id":"336","node_question":"Step 6: Identify any specified assets that, together with related liabilities and equity invetment, constitute a so-called 'silos\" of the legal entity.","node_type":"q","node_summary":"Certain variable interests may relate only to specific activities of the entity, and not the entity as a whole.","node_popover":"","node_r1":"Continue to Step 7","node_t1":"337","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"479","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":133},{"node_id":"337","node_question":"Step 7: Are any of the identified variable interests held by the company, its de facto agents and\/or its related parties?","node_type":"q","node_summary":"Having identified all variable interests of the entity, indicate which of those variable interests are held by the company, its de facto agents and its related parties.","node_popover":"","node_r1":"Yes","node_t1":"338","node_r2":"No","node_t2":"2310","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"The variable interest identification process is complete. Since the company holds a one or more variable interests, the determination of whether the entity is a variable interest entity is required.","node_c2":"Since none of the entity's variable interests are held by the company, its de facto agents or its related parties, no further analysis of the entity is required.","node_js":"na","id":134},{"node_id":"338","node_question":"Is the entity a variable interest entity?","node_type":"q","node_summary":"The determination of whether an entity is or is not a variable interest entity is complex. For those users having significant experience with this process, you may answer 'yes' or 'no' and make reference to your analysis in the comments box. For those with less or no experience with this analysis process, a more detailed approach is provided by clicking 'analyze'. Detailed instructions are provided in later steps; however, please be prepared to document your analysis separately (in a spreadsheet or some other form of your choosing).","node_popover":"","node_r1":"Yes","node_t1":"356","node_r2":"No","node_t2":"2311","node_r3":"Analyze","node_t3":"339","node_next":"","node_href":"","node_help":"481","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":135},{"node_id":"339","node_question":"Identify the holders of, and the amount of, equity investment at risk.","node_type":"q","node_summary":"Equity investment at risk is based GAAP equity, including equity classified in temporary and mezzanine equity. GAAP equity is then adjusted to remove 1) equity interests that doe not participate significantly in profits and losses, 2) equity interestss that were issued in exchange for a subordianted interest in one or more other VIEs, 3) amounts paid to the equity investor by the entity or by other parties involved in the entity (directly or indirectly), and 4) amounts financed for the equity investor by the entity orby other parties involved in the entity. This is a quantitative analysis.","node_popover":"","node_r1":"Continue","node_t1":"340","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"482","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":136},{"node_id":"340","node_question":"Identify specified assets, if any, that exist in the entity that are consolidated separately.","node_type":"q","node_summary":"Specified assets are associated with specific variable interests that do not have a variable interest in the entity as a whole. In this case, the variable interest is limited to the specified assets. By defintion, the fair value of the specified assets may not exceed 50% of the fair value of all of the entities assets, net of any siloed assets. Additionally, the variable interest holder in the specified assets may not hold any other variable interest in the entity. If either of these cases exist, then the variable interest is deemed to be a variable interest in the entity as a whole.","node_popover":"","node_r1":"Continue","node_t1":"341","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"484","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":137},{"node_id":"341","node_question":"Identify silos, if any, that exist in the entity and that are separately consolidated is stand-alone VIEs.","node_type":"q","node_summary":"A silo exists when a party holds a variable interest in specified assets of an entity and the specified assets are essentially the only source of payment for specified liabilities or other specified variable interests.","node_popover":"","node_r1":"Continue","node_t1":"342","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"483","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":138},{"node_id":"342","node_question":"After excluding expected losses associated one or more separately consolidated silos of the entity, if applicable, and specified assets of the legal entity, if applicable, is the legal equity investment at risk sufficient to finance the legal entity's activities?","node_type":"q","node_summary":"Determining whether the equity investment at risk is sufficient can be a qualitative analysis, a quantitatie analysis, or both. There is a rebuttable presumption in the ASC 810 guidance that equity investment at risk of less than 10% of total assets, both measured at fair value, consitutes insufficient equity investment at risk to finance expected losses.","node_popover":"","node_r1":"Yes","node_t1":"351a","node_r2":"No","node_t2":"351b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"487","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":139},{"node_id":"343","node_question":"","node_type":"","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"","id":140},{"node_id":"344","node_question":"","node_type":"","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"","id":141},{"node_id":"345","node_question":"","node_type":"","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"","id":142},{"node_id":"346","node_question":"","node_type":"","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"","id":143},{"node_id":"347","node_question":"","node_type":"","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"","id":144},{"node_id":"348","node_question":"","node_type":"","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"","id":145},{"node_id":"349","node_question":"","node_type":"","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"","id":146},{"node_id":"350","node_question":"","node_type":"","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"","id":147},{"node_id":"351","node_question":"Do the holders of the equity investment at risk lack the power to direct the activities that most significantly impact the entity's performance?","node_type":"q","node_summary":"The power to direct the activities of the entity is vested in the voting rights of the holders of equity investment at risk, unless those voting rights are insufficient due to rights and powers granted to other variable interests through the entity's governing documents and\/or contracts.","node_popover":"","node_r1":"Yes","node_t1":"352a","node_r2":"No","node_t2":"352b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"489","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":148},{"node_id":"352","node_question":"Was the equity investment at risk of the entity established with non-substantive voting rights?","node_type":"q","node_summary":"The holders of equity investment at risk are deemed to not have the power to direct the entity's activities if their voting rights are determined to be non-substantive.","node_popover":"","node_r1":"Yes","node_t1":"353a","node_r2":"No","node_t2":"353b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"491","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":149},{"node_id":"353","node_question":"Do parties other than the holders of the equity investment at risk have the obligation to absorb expected losses?","node_type":"q","node_summary":"Determining which parties have the obligation to absorb expected losses may be a qualitative analysis, a quantitative analysis, or both.","node_popover":"","node_r1":"Yes","node_t1":"354a","node_r2":"No","node_t2":"354b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"494","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":150},{"node_id":"354","node_question":"Do parties other than the holders of the equity investment at risk have the right to receive the residual returns?","node_type":"q","node_summary":"Determining which parties have the right to receive residual returns may be a qualitative analysis, a quantitative analysis, or both.","node_popover":"","node_r1":"Yes","node_t1":"355a","node_r2":"No","node_t2":"355b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"495","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"Based on your responses, the entity is considered a variable interest entity. The party that is the primary beneficiary of a VIE is required to consolidate the VIE. The analysis that follows will determine which variable interest holder is the primary beneficiary.","node_c2":"Based on your responses, the entity is not a variable interest entity.","node_js":"na","id":151},{"node_id":"355","node_question":"","node_type":"d","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":152},{"node_id":"356","node_question":"Is the company's sole variable interest associated with a specified asset?","node_type":"q","node_summary":"","node_popover":"","node_r1":"Yes","node_t1":"357","node_r2":"No","node_t2":"358","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":153},{"node_id":"357","node_question":"Is the specified asset greater than 50% of the entity's assets based on fair value?","node_type":"q","node_summary":"","node_popover":"","node_r1":"Yes","node_t1":"359","node_r2":"No","node_t2":"2315","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"Since the specified asset(s) are more than 50% of the legal entity's total assets, the company's variable interest should be evaluated in the context of the entire legal entity, not just the specified assets.","node_c2":"Since the specified asset(s) are not more than 50% of the legal entity's total assets, the company's variable interest should be evaluated with respect to just the specified assets.","node_js":"na","id":154},{"node_id":"358","node_question":"Is the company's sole variable interest associated with a silo of the entity?","node_type":"q","node_summary":"","node_popover":"","node_r1":"Yes","node_t1":"2316","node_r2":"No","node_t2":"359","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"Since the company's sole interest in the VIE is associated with a silo, the silo should be evaluated separately as a stand-alone entity.","node_c2":"","node_js":"na","id":155},{"node_id":"356","node_question":"Identify the VIE's activitiy(ies) that most significantly impact its economic performance.","node_type":"q","node_summary":"Since you have determined that the entity is a VIE, the analysis will now shift to determining which variable interest holder, if any, should consoldiate the legal entity. A VIE should be consolidted by the party holding a controlling financial interest. ASC 810-01-25-38A defines a controlling financial interest as having, \"...both of the folling characteristics: 1) The power to direct the activities of the VIE that most significantly impact the VIE's economic performance, [and] 2) the obligation to absorb losses of the VIE that could potentially be significant or the right to receive benefits that could potentially be significant.\"  The first characteristic involves a process of identifying the activities that could potentially produce benefits and\/or losses significant to the entity. This is a qualitative analysis that should start with the design of the entity and its primary sources of variability. The second characterisitic is primarily a qualitative analysis, also, though additional quantitative support is permitted in the guidance.","node_popover":"","node_r1":"Continue","node_t1":"359","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":156},{"node_id":"359","node_question":"Does the company on its own, that is without its de facto agents and related parties, have the power to direct the activities of the VIE that most significantly impact the VIE's economic performance?","node_type":"q","node_summary":"Does the company have the power to direct the entity's activities that most significantly impact its financial performance when circumstances arise or when events occur? Protective rights do not constitute power. Additionally, substantive kick-out rights and substantive participation rights should not be interpreted as having power unless a single party (together with its de facto agents and related parties) have the unilateral right to exercise those rights.","node_popover":"","node_r1":"Yes","node_t1":"360a","node_r2":"No","node_t2":"360b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":157},{"node_id":"360","node_question":"After excluding silos, if any, does the company have the obligation to absorb losses of the entity that could potentially be significant to the VIE or the right to receive benefits from the VIE that could potentially be significant to the VIE?","node_type":"q","node_summary":"This assessment should be made based upon the purpose, design and capital structure of the entity, the level of subordination of the company's interest(s), the proportion of interest(s) held within a given class of interest(s), the terms and characteristics of the company?s interest(s) in the entity, and the company's business purpose and\/or reasons for holding the interest(s).","node_popover":"","node_r1":"Yes","node_t1":"361a","node_r2":"No","node_t2":"361b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"Based on your responses, the company on its own is the primary beneficiary.","node_c2":"Based on your responses, the company on its own is not the primary beneficiary.","node_js":"na","id":158},{"node_id":"361","node_question":"","node_type":"d","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":159},{"node_id":"362","node_question":"Does the company, its related parties and de facto agents as a group have the power to direct the activities of the VIE that most significantly impact the VIE's economic performance?","node_type":"q","node_summary":"Does the company together with its de facto agents and related parties have the power to direct the entity's activities that most significantly impact its financial performance when circumstances arise or when events occur? Protective rights do not constitute power. Additionally, substantive kick-out rights and substantive participation rights should not be interpreted as having power unless a single party (together with its de facto agents and related parties) have the unilateral right to exercise those rights.","node_popover":"","node_r1":"Yes","node_t1":"363a","node_r2":"No","node_t2":"363b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":160},{"node_id":"363","node_question":"After excluding silos, if any, does the company, its related parties and de facto agents as a group have the obligation to absorb losses of the entity that could potentially be significant to the VIE or the right to receive benefits from the VIE that could potentially be significant to the VIE?","node_type":"q","node_summary":"This assessment should be made based upon the purpose, design and capital structure of the entity, the level of subordination of the company's interest(s) and those of its de facto agents and related parties (the \"group\"), the proportion of interest(s) held by the group within a given class of interest(s), the terms and characteristics of the groups?s interest(s) in the entity, and the group's business purpose and\/or reasons for holding the interest(s).","node_popover":"","node_r1":"Yes","node_t1":"364a","node_r2":"No","node_t2":"364b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"Based on your responses, the company's related party group is the primary beneficiary.","node_c2":"Based on your responses, the company's related party group is not the primary beneficiary.","node_js":"na","id":161},{"node_id":"364","node_question":"","node_type":"d","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":162},{"node_id":"365","node_question":"Is the reporting entity most closely associated with the VIE?","node_type":"q","node_summary":"Within the related party group (the company, its de facto agents and its related parties), is the company most closely associated with the entity?","node_popover":"","node_r1":"Yes","node_t1":"2317","node_r2":"No","node_t2":"2318","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"Since the company is the party most closely associated with the entity, the company should consolidated.","node_c2":"Since the company is not the party most closely associated with the entity, the company should not consolidated.","node_js":"na","id":163},{"node_id":"401","node_question":"Is the silo a variable interest entity?","node_type":"q","node_summary":"The determination of whether an entity is or is not a variable interest entity is complex. For those users having significant experience with this process, you may answer 'yes' or 'no' and make reference to your analysis in the comments box. For those with less or no experience with this analysis process, a more detailed approach is provided by clicking 'analyze'. Detailed instructions are provided in later steps; however, please be prepared to document your analysis separately (in a spreadsheet or some other form of your choosing).","node_popover":"","node_r1":"Yes","node_t1":"411","node_r2":"No","node_t2":"2319","node_r3":"Analyze","node_t3":"402","node_next":"","node_href":"","node_help":"506","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":164},{"node_id":"402","node_question":"Identify the holders of, and the amount of, equity investment at risk of the silo","node_type":"q","node_summary":"Equity investment at risk is based GAAP equity, including equity classified in temporary and mezzanine equity. GAAP equity is then adjusted to remove 1) equity interests that doe not participate significantly in profits and losses, 2) equity interestss that were issued in exchange for a subordianted interest in one or more other VIEs, 3) amounts paid to the equity investor by the entity or by other parties involved in the entity (directly or indirectly), and 4) amounts financed for the equity investor by the entity orby other parties involved in the entity. This is a quantitative analysis.","node_popover":"","node_r1":"Continue","node_t1":"403","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"507","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":165},{"node_id":"403","node_question":"Is the equity investment at risk sufficient to finance the silo's activities?","node_type":"q","node_summary":"Determining whether the equity investment at risk is sufficient can be a qualitative analysis, a quantitatie analysis, or both.","node_popover":"","node_r1":"Yes","node_t1":"404a","node_r2":"No","node_t2":"404b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"508","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":166},{"node_id":"404","node_question":"Do the holders of the equity investment at risk lack the power to direct the activities that most significantly impact the silo's performance?","node_type":"q","node_summary":"The power to direct the activities of the entity is vested in the voting rights of the holders of equity investment at risk, unless those voting rights are insufficient due to rights and powers granted to other variable interests through the entity's governing documents or through contracts.","node_popover":"","node_r1":"Yes","node_t1":"405a","node_r2":"No","node_t2":"405b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"509","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":167},{"node_id":"405","node_question":"Was the equity investment at risk of the silo established with non-substantive voting rights?","node_type":"q","node_summary":"The holders of equity investment at risk are deemed to not have the power to direct the entity's activities if their voting rights are determined to be non-substantive.","node_popover":"","node_r1":"Yes","node_t1":"406a","node_r2":"No","node_t2":"406b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"510","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":168},{"node_id":"406","node_question":"Do parties other than the holders of the equity investment at risk have the obligation to absorb the silo's expected losses?","node_type":"q","node_summary":"Determining which parties have the obligation to absorb expected losses may be a qualitative analysis, a quantitative analysis, or both.","node_popover":"","node_r1":"Yes","node_t1":"407a","node_r2":"No","node_t2":"407b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"511","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":169},{"node_id":"407","node_question":"Do parties other than the holders of the equity investment at risk have the right to receive the silo's residual returns?","node_type":"q","node_summary":"Determining which parties have the right to receive residual returns may be a qualitative analysis, a quantitative analysis, or both.","node_popover":"","node_r1":"Yes","node_t1":"408a","node_r2":"No","node_t2":"408b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"512","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"Based on your responses, the silo is considered a variable interest entity. The party that is the primary beneficiary of a silo that is VIE is required to consolidate the silo. The analysis that follows will determine which variable interest holder is the primary beneficiary.","node_c2":"Based on your responses, the silo is not a variable interest entity.","node_js":"na","id":170},{"node_id":"408","node_question":"","node_type":"d","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":171},{"node_id":"409","node_question":"Identify the silo's activitiy(ies) that most significantly impact its economic performance.","node_type":"q","node_summary":"This is a process of identifying the activities that could potentially produce benefits and\/or losses significant to the entity. This is a qualitative analysis that should start with the design of the entity and its primary sources of variability.","node_popover":"","node_r1":"Continue","node_t1":"410","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":172},{"node_id":"410","node_question":"Does the company on its own have the power to direct the activities of the silo that most significantly impact the VIE's economic performance?","node_type":"q","node_summary":"Does the company have the power to direct the entity's activities that most significantly impact its financial performance when circumstances arise or when events occur? Protective rights do not constitute power. Additionally, substantive kick-out rights and substantive participation rights should not be interpreted as having power unless a single party (together with its de facto agents and related parties) have the unilateral right to exercise those rights.","node_popover":"","node_r1":"Yes","node_t1":"411a","node_r2":"No","node_t2":"411b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":173},{"node_id":"411","node_question":"After excluding silos, if any, does the company have the obligation to absorb losses of the silo that could potentially be significant to the silo or the right to receive benefits from the silo that could potentially be significant to the silo?","node_type":"q","node_summary":"This assessment should be made based upon the purpose, design and capital structure of the entity, the level of subordination of the company's interest(s), the proportion of interest(s) held within a given class of interest(s), the terms and characteristics of the company?s interest(s) in the entity, and the company's business purpose and\/or reasons for holding the interest(s).","node_popover":"","node_r1":"Yes","node_t1":"412a","node_r2":"No","node_t2":"412b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"Based on your responses, the company on its own is the primary beneficiary.","node_c2":"Based on your responses, the company on its own is not the primary beneficiary.","node_js":"na","id":174},{"node_id":"412","node_question":"","node_type":"d","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":175},{"node_id":"413","node_question":"Does the company, its related parties and de facto agents as a group have the power to direct the activities of the silo that most significantly impact the silo's economic performance?","node_type":"q","node_summary":"Does the company together with its de facto agents and related parties have the power to direct the entity's activities that most significantly impact its financial performance when circumstances arise or when events occur? Protective rights do not constitute power. Additionally, substantive kick-out rights and substantive participation rights should not be interpreted as having power unless a single party (together with its de facto agents and related parties) have the unilateral right to exercise those rights.","node_popover":"","node_r1":"Yes","node_t1":"414a","node_r2":"No","node_t2":"414b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":176},{"node_id":"414","node_question":"After excluding silos, if any, does the company, its related parties and de facto agents as a group have the obligation to absorb losses of the entity that could potentially be significant to the silo or the right to receive benefits from the silo that could potentially be significant to the silo?","node_type":"q","node_summary":"This assessment should be made based upon the purpose, design and capital structure of the entity, the level of subordination of the company's interest(s) and those of its de facto agents and related parties (the \"group\"), the proportion of interest(s) held by the group within a given class of interest(s), the terms and characteristics of the groups?s interest(s) in the entity, and the group's business purpose and\/or reasons for holding the interest(s).","node_popover":"","node_r1":"Yes","node_t1":"415a","node_r2":"No","node_t2":"415b","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"Based on your responses, the company's related party group is the primary beneficiary.","node_c2":"Based on your responses, the company's related party group is not the primary beneficiary.","node_js":"na","id":177},{"node_id":"415","node_question":"","node_type":"d","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":178},{"node_id":"416","node_question":"Is the reporting entity most closely associated with the silo?","node_type":"q","node_summary":"Within the related party group (the company, its de facto agents and its related parties), is the company most closely associated with the entity?","node_popover":"","node_r1":"Yes","node_t1":"2323","node_r2":"No","node_t2":"2324","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"Since the company is the party most closely associated with the silo, the company should consolidated.","node_c2":"Since the company is not the party most closely associated with the silo, the company should not consolidated.","node_js":"na","id":179},{"node_id":"2001","node_question":"Account for the instrument under ASC 480.","node_type":"r","node_summary":"Certain provisions of ASC 480 have been deferred indefinitely for nonpublic companies. The conclusions for the ASC 480 section of this analysis will be expanded shortly to address the specific accounting requirements for each instrument as applied to both public and nonpublic companies. For now, please refer to ASC 480-10-30 and te related transition guidance.","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":180},{"node_id":"2002","node_question":"Record the instrument\/transaction at fair value as of the transaction date and classify the instrument in equity.","node_type":"r","node_summary":"Based on all of your responses and all intermediate conclusions, this instrument is a derivative that is both indexed to the entity's own stock and is classified in equity. Accordingly, the instrument is excepted out of derivative accounting. Record the instrument\/transaction at fair value as of the transaction date and classify the instrument in equity. There is no remeasure requirement. PLEASE NOTE: See conditions for continued classification in equity under 'Help'.","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":181},{"node_id":"2003","node_question":"Apply hedge accounting","node_type":"r","node_summary":"The hedge accounting module is under development. Until then please refer to ASC 815-20, 815-25, 815-30 and 815-35 for accounting guidance applicable to hedging transactions.","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":182},{"node_id":"2004","node_question":"Account for the freestanding instrument as a derivative.","node_type":"r","node_summary":"Based on all of your responses and all intermediate conclusions, this instrument is a derivative that meets none of the derivative accounting scope exceptions. Additionally, the instrument does not qualify for hedge accounting. Accordingly, the instrument should be accounted for at fair value with changes in fair value included in earnings.","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":183},{"node_id":"2005","node_question":"Account for the instrument as conventional debt","node_type":"r","node_summary":"Account for the instrument as conventional debt on the date of issuance. ","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":184},{"node_id":"2006","node_question":"Account for the debt and the BCF separately. ","node_type":"r","node_summary":"After allocating proceeds to all other instruments issued simultaneously with the convertible debt (e.g., detachable stock purchase warrants) based on relative fair value, compute the effective conversion price of the convertible debt. The difference between the fair value of the underlying stock on the closing date (or commitment date) times the shares issuable upon conversion is the preliminary BCF amount. However, the BCF amount recorded may not exceed the amount of proceeds allocated to the convertible debt. Accounting for a <a href=\"http:\/\/www.gaaplogic.com\/beneficial-conversion-feature\/\"><strong>beneficial conversion feature<\/strong><\/a> is covered in detail in the BCF module.","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":185},{"node_id":"2007","node_question":"Account for the entire hybrid instrument at fair value and do not bifurcate any embedded features.","node_type":"r","node_summary":"Classify the instrument as an asset or liability, as appropriate, at fair value on the date of issuance. Subsequently remeasure at fair value and include any changes in fair value in earnings.","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":186},{"node_id":"2008","node_question":"Bifurcate the embedded feature.","node_type":"r","node_summary":"An embedded derivative feature that is not clearly and closely related to the host contract, and that is either 1) not considered indexed to the entity's own stock or 2) does not meet the conditions for classification in equity, must be bifurcated. from the host contract and accounted for as a derivative measured at fair at inception and at each balance sheet. Include any changes in fair value in earnings","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":187},{"node_id":"2009","node_question":"Account for the instrument as a derivative.","node_type":"r","node_summary":"Based on your responses, the instrument does not meet the conditions for equity classification due to the settlement alternatives included in the agreement(s). The instrument should be accounted for as a derivative at fair value on the date of issuance and subsequently at each balance sheet date. Any changes in fair value should be included in earnings.","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":188},{"node_id":"2010","node_question":"Account for the instrument under either ASC 718 (employee stock-based compensation).","node_type":"r","node_summary":"The stock-based compensation modules are under development. Until then, please refer to ASC 718 for accounting guidance applicable to stock-based compensation issued to employees.","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":189},{"node_id":"2011","node_question":"Account for the instrument under ASC 505-50 (non-employee stock-based compensation).","node_type":"r","node_summary":"The stock-based compensation modules are under development. Until then, please refer to ASC 505-50 for accounting guidance applicable to stock-based compensation issued to nonemployees. PLEASE NOTE: The contract should be re-analyzed following delivery of the goods and\/or services by the nonemployee.","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":190},{"node_id":"2012","node_question":"Account for the instrument under ASC 840 (leases).","node_type":"r","node_summary":"Leases are exempt from derivative accounting and the lease should be accounted in accordance with ASC 820 (theGAAP Logic lease accounting module is under development and will be released soon). However, while lease agreements are not subject to derivative accounting based on a specfic scope exception, embedded features contained in the lease are potentially subject to bifurcation as embedded derivatives. Therefore, any equity-linked embedded features, and any other features that introduce economic or financial variability to the lease contract, should be evaluated separately from the host lease agreement under this Equity-Linked Transaction module.","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":191},{"node_id":"2013","node_question":"Do not bifurcate the embedded feature.","node_type":"r","node_summary":"Since the embedded derivative feature is clearly and closely related to the host contract, bifurcation of the feature is not required.","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":192},{"node_id":"2014","node_question":"Do not bifurcate the embedded feature.","node_type":"r","node_summary":"An embedded derivative feature is exempt from bifurcation if it is both 1) indexed to the entity's own stock and 2) embedded in a conventional convertible debt host contract. The instrument should be accounted for as conventional convertible debt with no bifurcation of the embedded conversion option.","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":193},{"node_id":"2015","node_question":"Account for the instrument as a derivative.","node_type":"r","node_summary":"Based on your responses, the instrument does not meet the conditions for equity classification due to the net cash settlement requirement included in the agreement(s). The instrument should be accounted for as a derivative at fair value on the date of issuance and subsequently at each balance sheet date. Any changes in fair value should be included in earnings.","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":194},{"node_id":"2016","node_question":"Unless the economic substance indicates otherwise, bifurcate the embedded initially as an asset or liability, as appropriate, at fair value.","node_type":"r","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":195},{"node_id":"2017","node_question":"Account for the instrument at FV with changes in FV included in income","node_type":"r","node_summary":"An equity-linked instrument that is not a derivative, but that is not considered indexed to the entity's stock must be classified as either an asset or a liability and recorded at fair value with changes in fair value included in earnings.","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":196},{"node_id":"2018","node_question":"Account for the instrument at FV with changes in FV included in income","node_type":"r","node_summary":"An equity-linked instrument that is not a derivative, but that does not meet both 1) criteria to be considered indexed to the entity's stock and 2) conditions for equity classification, must be classified as either an asset or a liability and recorded at fair value with changes in fair value included in earnings.","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":197},{"node_id":"2019","node_question":"Classify the instrument in equity","node_type":"r","node_summary":"An equity-linked instrument that is not a derivative, and that meets both the 1) criteria to be considered indexed to the entity's stock and 2) conditions for equity classification, should be classified equity.","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":198},{"node_id":"2020","node_question":"Account for the debt and BCF in accordance with ASC 470-20","node_type":"r","node_summary":"Proceeds received from the issuance of convertible debt subject to the cash conversion accounting requirements of ASC 470-20 must be allocated first to the debt component based on the fair value of the debt without consideration of the conversion option . The difference is allocated to the conversion option and classified in equity. As long as the conversion option qualifies for equity classification, the debt component is not subsequently remeasured. Accounting for a <a href=\"http:\/\/www.gaaplogic.com\/beneficial-conversion-feature\/\"><strong>beneficial conversion feature<\/strong><\/a> is covered in detail in the BCF module.","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":199},{"node_id":"2021","node_question":"Do not bifurcate the embedded feature.","node_type":"r","node_summary":"This feature does not require bifurcation from the host contract. You should proceed to evaluate any other embedded features.","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":200},{"node_id":"2301","node_question":"The entity is not a VIE. Apply the voting interest model if the company holds an equity interest in the entity.","node_type":"r","node_summary":"The variable interest entity accounting guidance is applicable only if the entity in which the company holds an interest is a \"legal entity\". A legal entity would include a corporation, partnership (whether or not legally registered with a governmental agency), limited liability company (LLC), joint venture, trust or any other legal structure that exists separate and apart from its equity investors.","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":201},{"node_id":"2302","node_question":"The entity is not a VIE. Apply the voting interest model if the company holds an equity interest in the entity.","node_type":"r","node_summary":"The variable interest entity accounting guidance does not apply to an entity that is a \"business\" as that term is defined in ASC 810.","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":202},{"node_id":"2303","node_question":"The entity is not a VIE. Apply the voting interest model if the company holds an equity interest in the entity.","node_type":"r","node_summary":"The entity meets the not-for-profit scope exception.","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":203},{"node_id":"2304","node_question":"The entity is not a VIE. Apply the voting interest model if the company holds an equity interest in the entity.","node_type":"r","node_summary":"The entity meets the employee benefit plan scope exception.","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":204},{"node_id":"2305","node_question":"The entity is not a VIE. Apply the voting interest model if the company holds an equity interest in the entity.","node_type":"r","node_summary":"The entity meets the investment company scope exception.","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":205},{"node_id":"2306","node_question":"The entity is not a VIE. Apply the voting interest model if the company holds an equity interest in the entity.","node_type":"r","node_summary":"The entity meets the \"separate accounts\" of a life insurance entity scope exception.","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":206},{"node_id":"2307","node_question":"The entity is not a VIE. Apply the voting interest model if the company holds an equity interest in the entity.","node_type":"r","node_summary":"The entity meets the \"information-out\" scope exception.","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":207},{"node_id":"2308","node_question":"The entity is not a VIE. Apply the voting interest model if the company holds an equity interest in the entity.","node_type":"r","node_summary":"The entity meets the government entity scope exception.","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":208},{"node_id":"2309","node_question":"The entity is not a VIE. Apply the voting interest model if the company holds an equity interest in the entity.","node_type":"r","node_summary":"The entity meets the criteria for deferral of application of the variable interest entity accounting guidance.","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"na","id":209},{"node_id":"2310","node_question":"The company does not hold a variable interest in the entity. Apply the voting interest model if the company holds an equity interest in the entity.","node_type":"r","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"","id":210},{"node_id":"2311","node_question":"The entity is not a VIE based on your analysis. Apply the voting interest model if the company holds an equity interest in the entity.","node_type":"r","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"","id":211},{"node_id":"2312","node_question":"Based on your responses, the entity is not a variable interest entity. The entity should not be consolidated under the variable interest entity model. Additionally, since the entity is not a VIE, any identified specified assets and\/or silos should also not be consolidated by the company. If the company holds an equity interest in the entity, the voting interest model should be applied to determine if the company should consolidate the entity.","node_type":"r","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"","id":212},{"node_id":"2313","node_question":"Based on your responses, the entity is a variable interest entity and the company is the primary beneficiary. As a result, the company must consolidate the entity in its consolidated financial statements.","node_type":"r","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"","id":213},{"node_id":"2314","node_question":"Based on your responses, the entity is a variable interest entity; however, neither the company, or the related party group comprised of the company, its de facto agents and its related parties, is the primary beneficiary. As a result, the company should not consolidate the entity in its consolidated financial statements.","node_type":"r","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"","id":214},{"node_id":"2315","node_question":"The company must consolidate the specified assets of the variable interest entity.","node_type":"r","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"","id":215},{"node_id":"2316","node_question":"Since the entity is a variable interest entity, the company should evaluate its variable interest in each silo that holds a variable interest is though silo is a satand-alone VIE.","node_type":"r","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"","id":216},{"node_id":"2317","node_question":"Based on your responses, the entity is a variable interest entity. You have also determined that the company and its related parties and de facto agents tegether meet the criteria for being the the primary beneficiary, and that the company is party most closely associated with the entity. As a result, the company must consolidate the entity in its consolidated financial statements. If the company also holds a variable interest in on or more identified silos of the entity, each silo should be evaluated separately as a stand-alone VIE.","node_type":"r","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"","id":217},{"node_id":"2318","node_question":"Based on your responses, the entity is a variable interest entity; however, while the company and its related parties and de facto agents tegether meet the criteria for being the the primary beneficiary, you have determined that the company is not the party most closely associated with the entity. As a result, the company should not consolidate the entity in its consolidated financial statements. If the company also holds a variable interest in on or more identified silos of the entity, each silo should be evaluated separately as a stand-alone VIE.","node_type":"r","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"","id":218},{"node_id":"2319","node_question":"The silo is not a VIE based on your analysis.","node_type":"r","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"","id":219},{"node_id":"2320","node_question":"Based on your responses, the silo is a variable interest entity; however, the company, nor the related party group comprised of the company, its de facto agents and its related parties, is not the primary beneficiary. As a result, the company should not consolidate the silo in its consolidated financial statements.","node_type":"r","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"","id":220},{"node_id":"2321","node_question":"Based on your responses, the silo is a variable interest entity and the company is the primary beneficiary. As a result, the company must consolidate the silo in its consolidated financial statements.","node_type":"r","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"","id":221},{"node_id":"2322","node_question":"Based on your responses, the silo is a variable interest entity; however, neither the company alsone, or the related party group comprised of the company, its de facto agents and its related parties, is the primary beneficiary. As a result, the company should not consolidate the silo in its consolidated financial statements.","node_type":"r","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"","id":222},{"node_id":"2323","node_question":"Based on your responses, the silo is a variable interest entity. You have also determined that the company and its related parties and de facto agents tegether meet the criteria for being the the primary beneficiary, and that the company is party most closely associated with the silo. As a result, the company must consolidate the silo in its consolidated financial statements.","node_type":"r","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"","id":223},{"node_id":"2324","node_question":"Based on your responses, the silo is a variable interest entity; however, while the company and its related parties and de facto agents tegether meet the criteria for being the the primary beneficiary, you have determined that the company is not the party most closely associated with the silo. As a result, the company should not consolidate the silo in its consolidated financial statements.","node_type":"r","node_summary":"","node_popover":"","node_r1":"","node_t1":"","node_r2":"","node_t2":"","node_r3":"","node_t3":"","node_next":"","node_href":"","node_help":"","node_faq":"","node_asc":"","node_blog":"","node_examples":"","node_c1":"","node_c2":"","node_js":"","id":224}]